app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `full_name`, `last_name`, `first_name`, `middle_name`, `role`, `status`, `created_at`, `updated_at`) VALUES ('tam0013', 'Tracy A McCormick', 'McCormick', 'Tracy', 'Alan', 0, 0, '2018-05-07 18:02:13', '2018-05-07 18:02:13')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save